import React from 'react';
import {
  View,
  Text,
  ScrollView,
  Linking,
  TouchableWithoutFeedback,
} from 'react-native';
import {MainCard, CardItem, Header} from '../../common';

const LicenceComponent = () => {
  const handleClick = () => {
    let url = 'https://aaua.com.ua';
    Linking.canOpenURL(url).then(supported => {
      if (supported) {
        Linking.openURL(url);
      } else {
        console.log("Don't know how to open URI: " + url);
      }
    });
  };

  let {titleText, boldText, link} = styles;
  return (
    <MainCard>
      <Header back>Ліцензія</Header>
      <CardItem>
        <ScrollView
          style={{
            width: '100%',
          }}>
          <View
            style={{
              justifyContent: 'center',
              alignItems: 'center',
            }}>
            <Text style={titleText}>Офіційні правила програми AAUA</Text>
          </View>
          <View>
            <Text
              style={[
                titleText,
                {
                  fontSize: 15,
                },
              ]}>
              Поняття і терміни
            </Text>
          </View>
          <View>
            <View>
              <Text style={{flexDirection: 'row'}}>
                <Text style={boldText}>
                  Програма лояльності AAUA (Програма)
                </Text>
                – комплексна система заходів, що регулює взаємовідносини між
                Організатором та Учасниками Програми, в рамках якої учасники
                мають можливість накопичувати бонуси, отримувати винагороди та
                знижки в результаті придбання товарів та послуг у Партнерів
                Організатора Програми.
              </Text>
            </View>
            <View>
              <Text>
                <Text style={boldText}>Організатор Програми</Text>– ААУА
                КОМПАНІ. Організатор володіє електронною базою даних яка
                зберігає інформацію про Учасників та історію їх покупок.
              </Text>
            </View>
            <View>
              <Text>
                <Text style={boldText}>Партнер Організатора Програми</Text>–
                встановлює знижки на свої послуги/товари та умови їх отримання і
                використання .
              </Text>
            </View>
            <View>
              <Text>
                <Text style={boldText}>Учасники </Text>– фізичні особи, які
                беруть участь у Програмі, згідно умов, що встановлює
                Організатор.
              </Text>
            </View>
            <View>
              <Text>
                <Text style={boldText}>Картка AAUA </Text>– пластикова карта, що
                надає можливість отримання знижок та/або спеціальних пропозицій
                при користуванні послугами, наданих Партнерами Компанії в обсязі
                і на умовах, обумовлених цим Порядком.
              </Text>
            </View>
            <View>
              <Text>
                <Text style={boldText}>Бонуси </Text>– одиниці виміру
                винагороди, які отримує Учасник при виконанні умов Програми.
                Конвертуються згідно умов Програми.
              </Text>
            </View>
            <View>
              <Text>
                <Text style={boldText}>ПІН-код </Text>– додатковий захист
                картки, що може бути встановлений Учасником як засіб авторизації
                (перевірки дозволу на доступ) в момент списання Бонусів.
              </Text>
            </View>
            <View>
              <Text>
                <Text style={boldText}>QR-код </Text>- матричний код, який є
                аналогом пластикової і віртуальної карток і розпізнається
                скануючим обладнанням
              </Text>
            </View>
            <View>
              <Text style={boldText}>1. Участь в Програмі</Text>
            </View>
            <View>
              <Text>
                <Text style={boldText}> 1.1 </Text>
                Учасниками Програми є особи, які отримають товар/послуги,
                проживають в Україні і яким виповнилось 18 років.
              </Text>
            </View>
            <View>
              <Text>
                <Text style={boldText}> 1.2 </Text>
                Пакет «Річна підписка», який містить картку та інформаційний
                буклет, можна отримати через офіційний сайт Організатора (
                <TouchableWithoutFeedback onPress={this.handleClick}>
                  <Text style={link}>https://aaua.com.ua </Text>
                </TouchableWithoutFeedback>
                ), купуючи товари або послуги у партнерів ассоціації або через
                мобільний додаток AAUA.
              </Text>
            </View>
            <View>
              <Text>
                <Text style={boldText}> 1.3 </Text>
                Термін реєстрації нових Учасників складає не більше 3 днів.
                Після реєстрації Учасники отримують SMS-повідомлення на номер
                мобільного телефону, що був вказаний при реєстрації, з
                інформацією про акції та спеціальні пропозиції.
              </Text>
            </View>
            <View>
              <Text style={boldText}>
                2. Зарахування та використання бонусів.
              </Text>
              <View>
                <Text>
                  <Text style={boldText}> 2.1 </Text> Учасник має можливість
                  накопичувати бонуси, здійснюючи покупки на АЗК WOG або товарів
                  та послуг у мобільному додатку AAUA.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}> 2.2 </Text>
                  Зарахування бонусів за купівлю пального або товарів та послуг
                  здійснюється таким чином:
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}> 2.2 </Text>
                  Зарахування бонусів за купівлю пального або товарів та послуг
                  здійснюється таким чином: 5 % від суми, сплаченої під час
                  покупки пального в АЗК 3% від суми, сплаченої під час покупки
                  товарів та послуг через мобільний додаток AAUA.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}> 2.3 </Text>
                  Бонуси стають доступними для використання Учасником впродовж
                  однієї доби після зарахування.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}> 2.4 </Text>
                  Зараховані бонуси зберігаються на картці учасника 1 (один)
                  календарний рік з моменту зарахування. У випадку, якщо Учасник
                  з будь-яких причин не використав бонуси протягом вказаного
                  терміну, їх залишок автоматично анулюється. Строк дії картки
                  необмежений.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}> 2.5 </Text>
                  Бонуси не є засобом платежу і можуть використовуватись
                  Учасником тільки для отримання винагороди – права придбання
                  товару або послуги.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}> 2.6 </Text>
                  Використовувати бонуси можуть лише зареєстровані Учасники.
                  Зареєструватися в Програмі Учасник може одним з наступних
                  способів:
                </Text>
                <View>
                  <Text>
                    <Text style={boldText}> 2.6.1 </Text>
                    Зателефонувати за номером гарячої лінії 0 800 50 50 24, та
                    надати оператору необхідну для реєстрації інформацію.
                  </Text>
                </View>
                <View>
                  <Text>
                    <Text style={boldText}> 2.6.2 </Text>
                    Заповнити спеціальну реєстраційну форму у режимі он-лайн за
                    допомогою Інтернет на сайті програми AAUA
                    <TouchableWithoutFeedback onPress={this.handleClick}>
                      <Text style={link}> https://aaua.com.ua </Text>
                    </TouchableWithoutFeedback>
                  </Text>
                </View>
                <View>
                  <Text>
                    <Text style={boldText}> 2.6.3 </Text>
                    Заповнити спеціальну реєстраційну форму у мобільному додатку
                    AAUA у режимі он-лайн.
                  </Text>
                </View>
              </View>
              <View>
                <Text>
                  <Text style={boldText}> 2.7 </Text>
                  Бонуси не зараховуються за покупки, здійснені з використанням
                  бонусів.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}> 2.8 </Text>
                  При поверненні товару, за покупку якого Учаснику були
                  зараховані бонуси, кількість бонусів, яка була зарахована
                  списується з картки.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}> 2.9 </Text>
                  Учасник має можливість оплатити пальне за допомогою
                  різноманітних платіжних систем.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}> 2.10 </Text>
                  Зняття бонусів WOG PRIDE в мережі АЗК WOG можливо лише з
                  пін-кодом.
                </Text>
              </View>
            </View>
            <View>
              <View>
                <Text style={boldText}>3. Типи карток</Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}>3.1.</Text>
                  Програмою передбачено два типи карток – звичайна (основна) і
                  віртуальна.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}>3.2.</Text>
                  Кожен учасник може бути користувачем основної (звичайної) або
                  віртуальної картки.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}>3.3.</Text>У випадку реєстрації нової
                  картки, стара картка блокується, нарахування бонусів по ній
                  припиняється. Залишок бонусів, який був на картці на момент її
                  блокування, перераховується на нову картку і далі.
                </Text>
              </View>
            </View>
            <View>
              <View>
                <Text style={boldText}>
                  4. Права та обов’язки Учасника Програми
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}>4.1 </Text>
                  Учасник, телефонуючи на номер гарячої лінії 0 800 50 50 24,
                  заповнюючи форму он-лайн реєстрації на сайті Програми або в
                  мобільному додатку AAUA для проходження реєстрації у Програмі,
                  тим самим підтверджує, що йому виповнилось 18 років, він
                  ознайомлений та погоджується з правилами Програми і дає згоду
                  на внесення його персональних даних до електронної бази даних,
                  що належить Організатору.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}>4.2</Text>
                  Учасник несе відповідальність за достовірність наданих даних,
                  а також своєчасне інформування про зміну свого телефонного
                  номеру, адреси та інших даних.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}>4.3 </Text>У разі надання недостовірних
                  даних про номер або VIN-коду авто, послуги безкоштовної
                  технічної та юридичної допомоги не надаються.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}>4.4 </Text>
                  Про кількість накопичених бонусів та можливість їх
                  використання Учасник може дізнатися, зателефонувавши за
                  номером гарячої лінії 0 800 50 50 24, за допомогою Web-сайту
                  Програми (
                  <TouchableWithoutFeedback onPress={this.handleClick}>
                    <Text style={link}>https://aaua.com.ua</Text>
                  </TouchableWithoutFeedback>
                  ) або в мобільному додатку AAUA.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}>4.5 </Text>
                  Учасник отримує право використовувати накопичені бонуси тільки
                  після проходження реєстрації його персональних даних в системі
                  AAUA у строки, передбачені умовами Програми, у разі коректного
                  заповнення усіх обов’язкових полів реєстраційної форми на
                  сайті Програми, у мобільному додатку або у разі надання
                  необхідної достовірної інформації оператору контакт-центру,
                  згідно п. 2.7. цих Правил.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}>4.6</Text>
                  Учасник має можливість перевіряти правильність нарахування
                  бонусів за допомогою персонального кабінету на сайті Програми
                  (тільки для зареєстрованих учасників), мобільного додатку AAUA
                  або зателефонувавши за номером телефону Гарячої лінії 0 800 50
                  50 24.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}>4.7</Text>
                  Зареєстрований Учасник має право звернутись з проханням
                  заблокувати свою картку.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}>4.8</Text>У разі втрати картки Учасник
                  зобов’язаний повідомити про це Організатора та заблокувати
                  картку зателефонувавши на гарячу лінію. Учасник має право
                  отримати нову картку із збереженням кількості накопичених
                  бонусів на момент блокування втраченої картки. Для цього
                  Учаснику необхідно звернутися за телефоном інформаційної лінії
                  програми AAUA. Історія накопичення бонусів Учасником буде
                  відновлена, якщо Учасник підтвердить дані, що були подані ним
                  при реєстрації.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}>4.9</Text>У випадку втрати картки AAUA
                  і до моменту її блокування, Учасник несе відповідальність за
                  всі дії виконані з карткою AAUA третіми особами.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}>4.10</Text>
                  Відновити картку з бонусами, що були на рахунку в момент її
                  блокування, може лише зареєстрований Учасник за допомогою
                  кодового слова, яке вказується Учасником при реєстрації.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}>4.11 </Text>
                  Учасник має право у будь-який момент відмовитись від участі у
                  Програмі.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}>4.12</Text>
                  Учасник надає Організатору право надсилати йому інформацію про
                  Програму особистого або загального характеру, спеціальні
                  пропозиції та новини за допомогою електронної пошти,
                  SMS-повідомлень або телефонного зв’язку.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}>4.13 </Text>В усіх питаннях, щодо
                  відносин з Організатором, Учасник керується Цими правилами та
                  вимогами чинного законодавства України.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}>4.14 </Text>
                  Учасник не має права передавати або розголошувати кодове слово
                  та ПІН-код третім особам.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}>4.15</Text>
                  Беручи участь у Програмі, Учасник, як суб‘єкт персональних
                  даних підтверджує, що ознайомлений з вимогами Закону України
                  «Про захист персональних даних» від 01.06.2010 р. № 2297-VІ та
                  інших нормативних актів про захист персональних даних і надає
                  згоду Організатору (ТОВ «ААУА КОМПАНІ») як власнику бази
                  персональних даних «AAUA» на обробку відомостей про нього, в
                  електронних формах за допомогою
                  інформаційно-телекомунікаційних систем в необхідному та
                  достатньому обсязі, а саме: прізвище ім‘я та по-батькові, дата
                  народження, стать, місце постійного проживання, номер телефону
                  Учасника, електронна адреса, тип, марка, рік випуску
                  транспортного засобу, який є у власності/користуванні Учасника
                  Програми, інформація про кількість та вік неповнолітніх членів
                  родини, інформація щодо банку, страхової компанії та
                  продуктового супермаркету, послугами яких користується Учасник
                  тощо. Право на обробку персональних даних, суб‘єкт
                  персональних даних надає Організатору з метою реалізації
                  правовідносин в межах завдань та умов функціонування Програми.
                </Text>
              </View>
              <View>
                <Text>
                  <Text style={boldText}>4.16 </Text>
                  Надаючи згоду на обробку персональних даних, Учасник Програми
                  повідомлений про включення його персональних даних до бази
                  персональних даних «AAUA» ТОВ «ААУА КОМПАНІ» з метою
                  досягнення цілей та реалізації завдань Програми та обізнаний
                  зі своїми правами, як суб‘єкта персональних даних, які
                  визначені ст. 8 Закону України «Про захист персональних
                  даних», а саме: знати про місцезнаходження бази персональних
                  даних, яка містить його персональні дані; її призначення та
                  найменування, місцезнаходження та/або місце проживання
                  (перебування) Власника цієї бази; давати відповідне доручення
                  щодо отримання цієї інформації уповноваженим особам, крім
                  випадків, встановлених законом; отримувати інформацію про
                  умови надання доступу до персональних даних; отримувати
                  інформацію про третіх осіб, яким передаються його персональні
                  дані, що містяться у відповідній базі персональних даних; на
                  доступ до своїх персональних даних, що містяться у відповідній
                  базі персональних даних; отримувати не пізніш як за тридцять
                  календарних днів з дня надходження запиту, крім випадків,
                  передбачених законом, відповідь про те, чи зберігаються його
                  персональні дані у відповідній базі персональних даних, а
                  також отримувати зміст його персональних даних, які
                  зберігаються; пред'являти вмотивовану вимогу із запереченням
                  проти обробки своїх персональних даних органами державної
                  влади, органами місцевого самоврядування при здійсненні їхніх
                  повноважень, передбачених законом; пред'являти вмотивовану
                  вимогу щодо зміни або знищення своїх персональних даних
                  будь-яким Власником цієї бази, якщо ці дані обробляються
                  незаконно чи є недостовірними; на захист своїх персональних
                  даних від незаконної обробки та випадкової втрати, знищення,
                  пошкодження у зв'язку з умисним приховуванням, ненаданням чи
                  несвоєчасним їх наданням, а також на захист від надання
                  відомостей, що є недостовірними чи ганьблять честь, гідність
                  та ділову репутацію фізичної особи; звертатися з питань
                  захисту своїх прав щодо персональних даних до органів
                  державної влади, органів місцевого самоврядування, до
                  повноважень яких належить здійснення захисту персональних
                  даних; застосовувати засоби правового захисту в разі порушення
                  законодавства про захист персональних даних.
                </Text>
              </View>
              <View>
                <View>
                  <Text style={boldText} />
                </View>
                <View>
                  <Text>
                    <Text style={boldText}>
                      5. Права та обов’язки Організатора Програми
                    </Text>
                  </Text>
                </View>
                <View>
                  <Text>
                    <Text style={boldText}>5.1 </Text>
                    Картки Учасників Програми «AAUA» є власністю Організатора
                    Програми.
                  </Text>
                </View>
                <View>
                  <Text>
                    <Text style={boldText}>5.2 </Text>
                    Організатор має виняткові права на управління Програмою, її
                    розвиток, доповнення та зміну умов.
                  </Text>
                </View>
                <View>
                  <Text>
                    <Text style={boldText}>5.3 </Text>З метою додаткового
                    захисту балансу бонусів та гаманця AAUA Організатор має
                    право в односторонньому порядку на встановлення пін-коду на
                    картку AAUA, повідомивши про це Учасника шляхом відправки
                    повідомлення на номер телефона вказаний при реєстрації.
                  </Text>
                </View>
                <View>
                  <Text>
                    <Text style={boldText}>5.4 </Text>
                    Організатор має право вносити зміни в умови Програми (зміни
                    у визначення спеціальної ціни, кількості бонусів, що
                    зараховуються за покупку, виключати з переліку винагород
                    окремі товари та послуги, припинення передбачуваних
                    Програмою окремих заходів або Програми в цілому,
                    впровадження нових заходів), про що повідомляє Учасників
                    Програми шляхом розміщення інформації у точках продажу та на
                    Web-сайті Програми.
                  </Text>
                </View>
                <View>
                  <Text>
                    <Text style={boldText}>5.5 </Text>
                    Організатор має право відмовити у видачі картки, вилучити чи
                    припинити дію картки у випадку виявлених фактів або
                    обґрунтованих підозр:
                  </Text>
                </View>
                <View>
                  <Text>
                    <Text style={boldText}>5.1.1. </Text>у використанні карток у
                    спосіб, що суперечить правилам Програми;
                  </Text>
                </View>
                <View>
                  <Text>
                    <Text style={boldText}>5.1.2. </Text>
                    при відсутності будь-яких операцій з використанням картки
                    впродовж 12 місяців.
                  </Text>
                </View>
                <View>
                  <Text>
                    <Text style={boldText}>5.6 </Text>
                    Якщо під час реєстрації Учасник надав не всі дані на вимогу
                    оператора Гарячої лінії, обов’язкові до заповнення, або
                    подані дані є некоректними, Організатор залишає за собою
                    право не вносити їх до бази даних і, відповідно, не
                    реєструвати Учасника в Програмі.
                  </Text>
                </View>
                <View>
                  <Text>
                    <Text style={boldText}>5.7 </Text>
                    Організатор залишає за собою право надавати відповіді по
                    всіх спірних питаннях на звернення Учасників впродовж 30
                    днів.
                  </Text>
                </View>
                <View>
                  <Text>
                    <Text style={boldText}>5.8 </Text>
                    Організатор залишає за собою право заблокувати картку AAUA у
                    випадку, якщо впродовж останнього року по ній не
                    здійснювалось жодної транзакції.
                  </Text>
                </View>
                <View>
                  <Text>
                    <Text style={boldText}>5.9 </Text>
                    Організатор залишає за собою право на встановлення обмежень
                    на списання бонусів Учасника Програми AAUA.
                  </Text>
                </View>
                <View>
                  <Text>
                    <Text style={boldText}>5.10 </Text>
                    Права і обов’язки щодо надання знижок Партнером компанії
                    виникають безпосередньо між Клієнтом та Партнером компанії.
                    Усі претензії щодо наданих знижок, передбачених Партнером
                    компанії, пред’являються Партнеру компанії. Компанія не несе
                    відповідальність у разі неналежного надання послуг/товарів
                    Клієнту Партнером компанії та знижок до них.
                  </Text>
                </View>
                <View>
                  <Text>
                    <Text style={boldText}>5.11 </Text>
                    Організатор зобов’язується належним чином збирати, зберігати
                    та обробляти дані Учасників Програми, використовувати їх в
                    рамках програми, а також не надавати їх третім особам без
                    згоди Учасника.
                  </Text>
                </View>
                <View>
                  <Text>
                    <Text style={boldText}>5.12 </Text>
                    Організатор залишає за собою право не зберігати анкетні дані
                    Учасників у друкованому вигляді.
                  </Text>
                </View>
                <View>
                  <Text>
                    <Text style={boldText}>5.13 </Text>В усіх питаннях, щодо
                    відносин з Учасниками Програми, Організатор керується цими
                    правилами та вимогами чинного законодавства України.
                  </Text>
                </View>
              </View>
            </View>
          </View>
        </ScrollView>
      </CardItem>
    </MainCard>
  );
};

const styles = {
  titleText: {
    fontSize: 20,
    fontWeight: '600',
    color: '#333',
  },
  boldText: {
    marginLeft: 5,
    marginRight: 5,
    fontSize: 15,
    fontWeight: '600',
    color: '#333',
  },
  link: {
    color: '#2199d8',
  },
};

export default LicenceComponent;
