export default {
  buttons: {
    enter: 'Вхід',
    get_sms_code: 'Замовити SMS код',
    next: 'Далі',
    restore_pass: 'Відновити пароль',
    buy: 'Купити',
  },
  labels: {
    phone_number: 'Номер телефону',
    password: 'Пароль',
    code_from_sms: 'Код із sms',
    repeat_pass: 'Повторіть пароль',
    car_year: 'Рік випуска',
    auto_brand: 'Марка авто',
    city: 'Місто',
    name: "Ім'я",
  },
  placeholders: {
    password: 'Введіть пароль',
    email: 'вкажіть ваш email',
    name: "Вкажіть ім'я",
    city: 'Вкажіть місто',
    auto_brand: 'Вкажіть марку авто',
  },
  modals: {
    error_title: 'Помилка',
    thanks_title: 'Дякуємо',
    close: 'Закрити',
    sms_sended: 'Смс з кодом відправлено',
    car_number: {
      title: 'Введіть номер',
      cancel: 'Відміна',
      pay: 'Оплатити',
    },
  },
  errors: {
    data_not_filled: 'Не всі поля заповнені або заповнені не вірно',
    registration_error: 'Помилка при реєстрації',
    password_not_matches: 'Пароль та повторний пароль мають бути однакові',
    wrong_email_format: 'Не вірний формат email',
  },
  screen_headers: {
    restore_pass: 'Відновлення пароля',
    personal_data: 'Персональні дані',
  },
  login_screen: {
    forgot_pass: 'Забули пароль',
    registration: 'Реєстрація',
    asociation: 'Асоціація',
    driwers: 'Автомобілістів',
    ukraine: 'України',
  },
  registration_screen: {
    iam_adault: 'Мені вже є 18',
    agree_licence: 'Я ознайомлений з ',
    licence: 'ліцензією',
    agree_get_info: 'Я згоден отримувати інформацію від AAUA',
    modal: {
      check_phone: {
        title: 'Помилка',
        message: 'Даний номер телефону вже зареєстровано',
      },
      check_code: {
        title: 'Помилка',
        message: 'Невірний смс-код',
      },
    },
    second_stage: {},
  },
  valet_screen: {
    screen_header: 'Гаманець',
    grivna_1: 'гривня',
    grivna_2: 'гривні',
    grivna_5: 'гривень',
    add_to_balance: 'Поповнити баланс',
    service_develop: 'Сервіс в розробці',
  },
  bottomMenu: {
    bonus_wog: 'Бонуси WOG',
    messages: 'Повідомлення',
    bonus_aaua: 'Бонуси AAUA',
  },
  leftBarMenu: {
    valet: 'Гаманець',
    discounts: 'Знижки партнерів',
    subscription: 'Підписка AAUA',
    store: 'Магазин',
    fuel: 'Пальне',
    insurance: 'Страхування',
    history: 'Історія покупок',
    feedback: "Зворотній зв'язок",
    questions: 'Питання/відповідь',
    on_road_support: 'Допомога в дорозі',
    modal: {
      header: 'Підтвердження',
      message: 'Ви точно хочете вийти?',
      button_yes: 'Так',
      button_cancel: 'Закрити',
    },
  },
  discounts_screen: {
    screen_header: 'Знижки партнерів',
    discount_cards: 'Дисконтні карти',
    catalog: 'Каталог',
  },
  permission_request: {
    title: 'AAUA потрібен доступ до геоданних',
    message:
      'За допомогою геолокації ми зможемо встановити вашу адресу автоматично',
  },
  map_screen: {
    modal: {
      close: 'Закрити',
      apply: 'Застосувати',
    },
  },
  subscription_screen: {
    screen_header: 'Підписка AAUA',
    description_header: 'До річної підписки входять:',
    description_tech_asist:
      'Технічна допомога по всій території України: евакуатор, підзарядка акумулятора, заміна колеса, підвіз палива. Послуга надається безкоштовно.',
    description_legal_asist:
      'Цілодобова юридична допомога та консультації  "Автоадвоката"',
    description_insurance_asist:
      'Послуги страхового адвоката. Якісна та оперативна допомога оформлення документів з виплати по страховому випадку.',
    description_bonus_system: 'Додаткова знижка на пальне та бонуси AAUA',
    description_services: 'Цілодобовий консьєрж-сервіс.',
    description_details: 'Детальніше',
    description_contract: 'Публічний договір',
    details: {
      what_is_subscription:
        'Підписка є пакетом опцій та послуг від асоціації, який допомагає економити час та гроші  під-час  експлуатації автомобіля та надає цілодобовий захист в дорозі по всій території України.',
      tech_help: 'Технічна допомога',
      tech_help_description:
        'Якщо внаслідок поломки, ДТП чи іншої події, автомобіль не здатен пересуватися Ви можете безкоштовно скористатися 1 (один) раз будь-якою з перелічених послуг на вибір протягом терміну дії Підписки. До послуг технічної допомоги відносяться:',
      car_evacuation: 'Евакуація Транспортного засобу',
      car_evacuation_point_1:
        'Евакуація проводиться з місця настання Події до найближчої авторизованої профільної СТО відповідно до марки ТЗ Клієнта.',
      car_evacuation_point_2:
        'Альтернативна евакуація надається у разі бажання Клієнта транспортувати ТЗ не до найближчої авторизованої профільної СТО, а в будь-яке інше місце.',
      car_evacuation_point_3:
        'У разі, якщо Клієнт бажає евакуювати ТЗ до іншої авторизованої профільної СТО, що знаходиться на більш відділеній відстані від місця Події, Клієнт сплачує за власні кошти різницю між відстанню до бажаної та відстанню до рекомендованої Компанією СТО.',
      car_evacuation_point_4:
        'У випадку перебільшення фінансових лімітів, Клієнт самостійно сплачує суму, на яку вартість послуги перевищує ліміт.',
      car_evacuation_cost:
        'Послуги евакуації надаються в межах грошового ліміту: 1000 грн.',
      fuel_delivery: 'Доставка палива',
      fuel_delivery_description:
        'У випадку непередбачуваної ситуації, коли пальне закінчилося раніше, ніж Клієнт зміг дістатися до АЗС, та в результаті чого настала зупинка двигуна:',
      fuel_delivery_description_point_1:
        'клієнту буде організовано доставка палива до місця зупинки транспортного засобу;',
      fuel_delivery_description_point_2:
        'компанія сплачує лише доставку, вартість та кількість палива Клієнт замовляє та сплачує самостійно.',
      start_engine: {
        title:
          'Запуск двигуна від стороннього джерела живлення (підзарядка АКБ)',
        description:
          'У випадку непередбачуваної ситуації, коли АКБ Транспортного засобу втратила свій заряд та спроби самостійно запустити двигун Транспортного засобу не мають результату:',
        point_1:
          'компанією буде організовано виїзд служби технічної допомоги, яка допоможе Клієнту запустити двигун від стороннього джерела живлення;',
        point_2:
          'після вдалого запуску двигуна службою технічної допомоги, Клієнт повинен негайно звернутися до рекомендованої Компанією авторизованої профільної СТО для вирішення проблеми;',
        point_3:
          'в разі невдалих спроб службою технічної допомоги запустити двигун, Клієнту буде запропонована послуга евакуації Транспортного засобу.',
      },
      wheel_change: {
        title: 'Заміна пошкодженого колеса',
        description:
          'У випадку непередбачуваної ситуації, коли колесо Транспортного засобу пошкоджено та необхідна його заміна:',
        point_1:
          'компанією буде організовано виїзд служби технічної допомоги, яка допоможе замінити колесо на запасне колесо Клієнта;',
        point_2:
          'в разі пошкодження водночас двох або більше коліс, Клієнту буде запропонована послуга евакуації Транспортного засобу;',
        point_3:
          'якщо Клієнт не має запасного колеса, Клієнту буде запропонована послуга евакуації Транспортного засобу.',
      },
      emergancy_door_open: {
        title: 'Аварійне відкриття дверей, відігрів замків',
        description:
          'У випадку непередбачуваної ситуації, коли двері Транспортного засобу неможливо відчинити через втрату чи поломку ключів, зачинення їх у салоні чи багажнику, через замерзання замків, внаслідок чого Клієнт не може потрапити в салон Транспортного засобу :',
        point_1:
          'компанією буде організовано виїзд служби технічної допомоги, яка допоможе Клієнту відчинити двері Транспортного засобу;',
        point_2:
          'в разі невдалих спроб службою технічної допомоги відчинити двері Транспортного засобу, Клієнту буде запропонована послуга евакуації Транспортного засобу.',
      },
      legal_help: {
        title: 'Юридична допомога',
        description: 'До складу пакету входять такі основні послуги:',
        point_1:
          'консультації з питань взаємодії з представниками дорожньої поліції;',
        point_2: 'первинні консультації у випадку ДТП;',
        point_3: 'доступ до бази зразків документів;',
        point_4: 'консультації з питань взаємодії зі страховою компанією;',
        point_5: 'консультації щодо оскарження штрафів за порушення ПДР;',
        point_6: 'консультації з питань заповнення Європротоколу;',
        point_7:
          'консультації з питань отримання виплати від страхової компанії.',
        notice: {
          title: 'Примітки:',
          point_1:
            'консультації надаються за допомогою телефонного зв’язку операторами call-center;',
          point_2:
            'підготовка позову можлива лише за умови надання всіх необхідних документів високої якості;',
          point_3:
            'додаткові послуги автоюриста надаються на основі окремої угоди.',
        },
      },
      consultation: {
        title: 'Послуги інформаційної та консультативної підтримки',
        location_information: {
          title: 'Інформація про місцезнаходження, адресу та телефони:',
          point_1: 'станцій технічного обслуговування;',
          point_2: 'автозаправних станцій;',
          point_3: 'послуг евакуатора;',
          point_4: 'аварійного комісара;',
          point_5: 'послуг таксі;',
          point_6: 'готелів;',
          point_7: 'державної автомобільної інспекції;',
          point_8: 'медичних установ;',
          point_9: 'страхових компаній та ін...',
        },
        consultation: {
          title: 'Консультації при поломці:',
          point_1:
            'технічна консультація щодо особливостей експлуатації т/з, порядку та строках проходження ТО;',
          point_2:
            'передача термінового повідомлення від Клієнта (факс, SMS-повідомлення, e-mail);',
          point_3: 'пошук необхідної інформації в мережі Internet.',
        },
        crash_consultation: {
          title: 'Консультації при ДТП:',
          point_1: 'порядок дій на місці ДТП;',
          point_2: 'юридична підтримка;',
          point_3: 'загальний порядок звернень до страхової компанії;',
          point_4: 'порядок оформлення документів;',
          point_5:
            'інформація про місцезнаходження та телефони екстрених служб;',
          point_6: 'консультації лікаря по телефону.',
        },
      },
      organization_services: {
        title: 'Організаційні послуги',
        description:
          'Клієнт самостійно сплачує вартість послуг, організованих Компанією на його прохання:',
        point_1: 'виклик ДАІ;',
        point_2: 'виклик служби порятунку;',
        point_3: 'виклик аварійного комісара;',
        point_4: 'організація автотоварознавчої експертизи;',
        point_5: 'виклик карети швидкої медичної допомоги;',
        point_6: 'організація стаціонарного лікування;',
        point_7: 'виклик таксі;',
        point_8: 'бронювання залізничних, автобусних, та авіа квитків;',
        point_9: 'організація прокатного автомобіля;',
        point_10: 'пошук та бронювання номеру в готелі;',
        point_11: 'виклик та залучення інших організацій за проханням Клієнта.',
      },
    },
  },
  fuel_screen: {
    header: 'Пальне',
    aaua_card: {
      header: 'Карта AAUA',
      add_card: 'Додати карту',
      add_virtual_card: 'Віртуальна карта',
      description:
        'Для отримання знижки додайте, будь ласка, номер Вашої карти AAUA 7777773xххххххх або згенеруйте віртуальну.',
      description_site:
        'Для активації віртуальної карти і встановлення пін-коду безпеки необхідно зареєструвати карту на сайті',
      description_phone: 'або за номером 0800 300 525.',
      order_virtual_card: 'Замовити віртуальну карту',
      close: 'Закрити',
      virtual_card: {
        header: 'Ваша віртуальна карта створена',
        message: 'Дякуємо за замовлення',
      },
    },
    add_card: {
      header: 'Додавання картки',
      card_number: 'Номер картки',
      add_card: 'Додати картку',
      card_added: 'Дані успішно відправлені',
      errors: {
        unauthorized: 'Будь ласка авторизуйтесь',
        some_wrong: 'Сталася помилка, спробуйте пізніше',
        no_card: 'Карта не передана',
        not_found: 'Карта в базі не знайдена',
      },
    },
    present: 'В наявності',
    absent: 'Нема в наявності',
    discount: 'Знижка',
    qr_code: {
      modal: {
        requested: 'Запит успішно відправлено',
      },
      errors: {
        wrong_token: 'Невірний токен партнера',
        wrong_code: 'Невірний код партнера',
        unknown_card: 'Невідома карта',
        wrong_phone: 'Карта має інший номер телефону',
        card_is_blocked: 'Карту не можна використовувати в додатку',
      },
      message:
        'Якщо у Вас не працює QR-код чи виникли труднощі з реєстрацією, залиште заявку і менеджер допоможе.',
      this_is_your_card_text:
        'Це Ваша віртуальна карта. Для активації віртуальної карти і встановлення пін-коду безпеки необхідно зареєструвати карту на сайті',
      or_call: 'чи зателефонувати за номером',
      activation_request: 'Заявка на активацію',
      activation_requested: 'Заявка на активацію відправлена',
    },
  },
  on_road_support_screen: {
    header: 'Допомога в дорозі',
    details: {
      thanks: 'Дякуємо',
      close: 'Закрити',
      error: 'Помилка',
      order: 'Замовити',
    },
  },
  questions_screen: {
    header: 'Питання/Відповідь',
    what_is_aaua: {
      header: 'Що таке програма «AAUA»?',
      description:
        'Комплексна система заходів, яка регулює взаємовідносини між Організатором та Учасниками, в рамках якої учасники мають можливість накопичувати бонуси, отримувати бонуси та знижки в результаті покупки товарів і послуг у партнерів Організатора програми.',
    },
    how_get_card: {
      header: 'Як отримати картку учасника програми «AAUA»?',
      description:
        'Пакет "Карта учасника", який містить карту та інформаційний буклет, можна отримати оформивши Підписку AAUA через офіційний сайт Організатора (https://aaua.com.ua), мобільний додаток "AAUA" або придбати у партнера програми.',
    },
    card_coast: {
      header: 'Скільки коштує карта «AAUA»?',
      description:
        'Пакет "Карта учасника", який містить карту та інформаційний буклет, можна отримати оформивши Підписку AAUA через офіційний сайт Організатора (https://aaua.com.ua), мобільний додаток "AAUA" або купуючи товари та послуги у партнера програми.',
    },
    bonuses: {
      header: 'Як нараховуються бонуси?',
      description:
        'Нарахування бонусів за покупку палива або товарів і послуг відбувається наступним чином: 1л = 1.5 грн бонусів «WOG», які можна далі використовувати на купівлю палива і товарів в мережі АЗК. 1л = 1 бонус AAUA при купівлі палива в АЗК «WOG» 3% від суми, бонусами AAUA, заплаченої при купівлі товарів або послуг через мобільний додаток «AAUA»',
    },
    when_get_bonuses: {
      header: 'З якого момента я можу накопичувати бонуси?',
      description:
        'Бонуси можно відразу після першої покупки на АЗК «WOG» або в мобільному додатку.',
    },
    bonuses_counts: {
      header: 'Як дізнатись скільки всього бонусів я накопив?',
      description:
        'Перевірити баланс бонусів можна: - в чеку після кожної покупки на АЗК «WOG»; - в персональному кабінеті на сайті www.aaua.com.ua; - в мобільному додатку «AAUA»; - за телефоном гарячої лінії «AAUA» - 0 800 334 174.',
    },
    card_period: {
      header: 'Термін дії карти «AAUA»?',
      description:
        'Картка "AAUA" має необмежений термін дії. Дія картки "AAUA" може бути призупинена при відсутності будь-яких операцій з її використанням на протязі 12 місяців.',
    },
    bonuses_period: {
      header: 'Як довго бонуси можуть зберігатись на моїй картці?',
      description:
        'Бонуси зберігаються на картці учасника 1 (один) календарний рік з моменту нарахування. У випадку, якщо Учасник за будь-якої причини не використав бонуси на протязі вказаного періоду, їх залишок автоматично анулюється. Термін дії карти необмежений.',
    },
    bonuses_exchange: {
      header: 'На що я можу обміняти бонуси?',
      description:
        'Бонуси "WOG" можна обміняти на пальне і товари у "WOG Маркет". Бонуси "AAUA"   можна  обміняти на товари та послуги в мобільному додатку "AAUA"',
    },
    bonuses_wog: {
      header: 'Не можу зняти бонуси «WOG»?',
      description:
        'Для зняття бонусів «WOG» і встановлення пін-коду необхідно зареєструвати картку за телефоном: 0 800 300 525.',
    },
    how_register: {
      header: 'Як я можу зареєструватись в програмі?',
      description:
        'На офіційному сайті Організатора (https://www.aaua.com.ua) або через мобільний додаток «AAUA».',
    },
  },
  feedback_screen: {
    header: "Зворотній зв'язок",
    service_phone: 'Телефон служби підтримки',
    send: 'Відправити',
    subject: {
      title: 'Тема',
      placeholder: 'Введіть тему',
    },
    message: {
      title: 'Повідомлення',
      placeholder: 'Введіть повідомлення',
    },
    modal: {
      message: 'Ваше повідомлення відправлено',
    },
  },
  insurance_screen: {
    header: 'Страхування',
    get_proposal: 'Отримати пропозицію',
    buy_online: 'Купити онлайн',
    categories: {
      kasko: 'КАСКО',
      osago: 'Автоцивілка',
    },
    kasko: {
      car_price: 'Вартість авто в гривні',
      car_brand: {
        title: 'Марка авто',
        placeholder: 'Виберіть авто',
      },
      car_model: {
        title: 'Модель авто',
        placeholder: 'Виберіть марку авто',
      },
      car_year: {
        title: 'Рік випуску',
        placeholder: '',
      },
      select_car_brand: 'Введіть марку авто',
      select_car_brand_header: 'Марка авто',
      thanks: 'Дякуємо',
      request_accepted: 'Вашу заявку прийнято',
    },
    osago: {
      engine_volume: {
        title: "Об'єм двигуна",
        xsmall: 'Легкові автомобілі - до 1600 см3',
        small: 'Легкові автомобілі - від 1601 см3 до 2000 см3',
        medium: 'Легкові автомобілі - від 2001 см3 до 3000 см3',
        large: 'Легкові автомобілі - понад 3000 см3',
      },
      car_city: {
        title: 'Прописка власника авто в техпаспорті',
        placeholder: 'Введіть назву міста',
      },
      get_proposal: 'Отримати пропозицію',
      buy: 'купити електронний',
      insurance: 'страховий поліс',
      or: 'АБО',
      buy_online: 'Купити онлайн',
      city: 'Місто',
      thanks: 'Дякуємо',
      request_accepted: 'Вашу заявку прийнято',
    },
  },
  settings_screen: {
    header: 'Налаштування',
    privacy_title: 'Я приймаю умови користувацької угоди',
    pushes_title: 'Дозволити присилати push-повідослення',
    politics_title: 'Я приймаю політику використання',
    share: 'Поділитись з друзями',
    call: 'Подзвонити',
    phone_title: 'Телефон служби підтримки',
  },
  messages_screen: {
    header: 'Повідомлення',
    error: 'Щось пішло не так, будь-ласка спробуйте пізніше',
    empty_list: 'У вас ще немає повідомлень',
  },
};
